app/controllers/admin/requests_controller.rb

    def resolve
      request = Request.find(params[:id])
---
SELECT  `requests`.* FROM `requests` WHERE `requests`.`id` = 1 LIMIT 1