app/controllers/comments_controller.rb

SELECT  `requests`.* FROM `requests` WHERE `requests`.`id` = 7 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`request_id` = 7 ORDER BY `comments`.`created_at` DESC
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (12, 10)
---
  def index
    request = Request.find(params[:request_id])
    render(
      json: request.comments
                   .includes(:user)
                   .order(created_at: :desc)
                   .to_json(include: :user)
    )