app/controllers/requests_controller.rb

  def index
    requests = current_user.requests.includes(:user).order(updated_at: :desc)
---
SELECT `requests`.* FROM `requests` WHERE `requests`.`user_id` = 14 ORDER BY `requests`.`updated_at` DESC

  def resolve
    request = current_user.requests.find(params[:id])
---
SELECT  `requests`.* FROM `requests` WHERE `requests`.`user_id` = 16 AND `requests`.`id` = 13 LIMIT 1